<a href="https://colab.research.google.com/github/AbelKristanto/machine-learning/blob/main/basic_learning_ML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# use turicreate
!pip install -U turicreate

In [37]:
# import useful library
import pandas as pd
import turicreate as tc
from pandas_profiling import ProfileReport

In [9]:
# call dataset
data = pd.read_csv("/content/people-example.csv")
data

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  7 non-null      object
 1   Last Name   7 non-null      object
 2   Country     7 non-null      object
 3   age         7 non-null      int64
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [6]:
# show profiling
data.describe()

             age
count   7.000000
mean   23.142857
std     1.069045
min    22.000000
25%    22.500000
50%    23.000000
75%    23.500000
max    25.000000

In [13]:
# show counting data
data.age.value_counts()

23    3
22    2
24    1
25    1
Name: age, dtype: int64

In [18]:
data.Country.unique()

array(['United States', 'Canada', 'England', 'USA', 'Poland',
       'Switzerland'], dtype=object)

In [19]:
# concat column
data['Full Name'] = data['First Name'] + ' ' + data['Last Name']
data.head()

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper

In [21]:
data['age'] * 2

0    48
1    46
2    44
3    46
4    46
5    44
6    50
Name: age, dtype: int64

In [23]:
data['Country'].value_counts()

United States    2
Canada           1
England          1
USA              1
Poland           1
Switzerland      1
Name: Country, dtype: int64

In [24]:
# use .apply to do advance transformation of our data
# change country United Stated into USA
def transform_country(country):
  if country == 'United States':
    return 'USA'
  else:
    return country

In [25]:
transform_country('United States')

'USA'

In [26]:
transform_country('Indonesia')

'Indonesia'

In [35]:
data['Country'] = data['Country'].apply(transform_country)

In [36]:
data

  First Name Last Name      Country  age       Full Name
0        Bob     Smith          USA   24       Bob Smith
1      Alice  Williams       Canada   23  Alice Williams
2    Malcolm      Jone      England   22    Malcolm Jone
3      Felix     Brown          USA   23     Felix Brown
4       Alex    Cooper       Poland   23     Alex Cooper
5        Tod  Campbell          USA   22    Tod Campbell
6      Derek      Ward  Switzerland   25      Derek Ward

In [39]:
# read data using wiki people
# dataset preparation from Kaggle
!mkdir -p ~/.kaggle
!cp kaggle.json ~/.kaggle/
!chmod 600 ~/.kaggle/kaggle.json

In [40]:
!kaggle datasets download -d sameersmahajan/people-wikipedia-data

Downloading people-wikipedia-data.zip to /content
 31% 9.00M/29.4M [00:00<00:00, 27.2MB/s]
100% 29.4M/29.4M [00:00<00:00, 66.4MB/s]

In [41]:
!unzip "/content/people-wikipedia-data.zip"

Archive:  /content/people-wikipedia-data.zip
  inflating: people_wiki.csv

In [42]:
df = pd.read_csv('people_wiki.csv')

In [43]:
df.head()

                                                 URI  ...                                               text
0        <http://dbpedia.org/resource/Digby_Morrell>  ...  digby morrell born 10 october 1979 is a former...
1       <http://dbpedia.org/resource/Alfred_J._Lewy>  ...  alfred j lewy aka sandy lewy graduated from un...
2        <http://dbpedia.org/resource/Harpdog_Brown>  ...  harpdog brown is a singer and harmonica player...
3  <http://dbpedia.org/resource/Franz_Rottensteiner>  ...  franz rottensteiner born in waidmannsfeld lowe...
4               <http://dbpedia.org/resource/G-Enka>  ...  henry krvits born 30 december 1974 in tallinn ...

[5 rows x 3 columns]

In [44]:
# How many rows are in data?
df.shape

(42786, 3)

In [46]:
# Which name is in the last row?
df.tail()

                                                     URI  ...                                               text
42781   <http://dbpedia.org/resource/Motoaki_Takenouchi>  ...  motoaki takenouchi born july 8 1967 saitama pr...
42782  <http://dbpedia.org/resource/Alan_Judge_(footb...  ...  alan graham judge born 14 may 1960 is a retire...
42783         <http://dbpedia.org/resource/Eduardo_Lara>  ...  eduardo lara lozano born 4 september 1959 in c...
42784  <http://dbpedia.org/resource/Tatiana_Faberg%C3...  ...  tatiana faberg is an author and faberg scholar...
42785       <http://dbpedia.org/resource/Kenneth_Thomas>  ...  kenneth thomas born february 24 1938 was chief...

[5 rows x 3 columns]

In [54]:
data = pd.read_csv('home_data.csv')
data.head()

           id             date   price  ...     long  sqft_living15  sqft_lot15
0  7129300520  20141013T000000  221900  ... -122.257           1340        5650
1  6414100192  20141209T000000  538000  ... -122.319           1690        7639
2  5631500400  20150225T000000  180000  ... -122.233           2720        8062
3  2487200875  20141209T000000  604000  ... -122.393           1360        5000
4  1954400510  20150218T000000  510000  ... -122.045           1800        7503

[5 rows x 21 columns]

In [94]:
# REGRESION
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error

In [98]:
advanced_features = [
'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors', 'zipcode',
'condition', # condition of house				
'grade', # measure of quality of construction				
'waterfront', # waterfront property				
'view', # type of view				
'sqft_above', # square feet above ground				
'sqft_basement', # square feet in basement				
'yr_built', # the year built				
'yr_renovated', # the year renovated				
'lat', 'long', # the lat-long of the parcel				
'sqft_living15', # average sq.ft. of 15 nearest neighbors 				
'sqft_lot15', # average lot size of 15 nearest neighbors 
]
my_features = ['bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors', 'zipcode']

In [55]:
used_data = ['bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors', 'zipcode', 'price']
df = data[used_data]
df.head()

   bedrooms  bathrooms  sqft_living  sqft_lot  floors  zipcode   price
0         3       1.00         1180      5650     1.0    98178  221900
1         3       2.25         2570      7242     2.0    98125  538000
2         2       1.00          770     10000     1.0    98028  180000
3         4       3.00         1960      5000     1.0    98136  604000
4         3       2.00         1680      8080     1.0    98074  510000

In [77]:
# the highest average house price. What is the average house price of that zip code?
high = pd.DataFrame(df.groupby('zipcode')['price'].mean())
high.max()

price    2160606.6
dtype: float64

In [78]:
high[high['price']==2160606.6]

             price
zipcode
98039    2160606.6

In [92]:
# What fraction of the houses have living space between 2000 sq.ft. and 4000 sq.ft.?
scale = df[df['sqft_living'] >= 2000]
scale = scale[scale['sqft_living'] <= 4000]
scale.head()

    bedrooms  bathrooms  sqft_living  sqft_lot  floors  zipcode    price
1          3       2.25         2570      7242     2.0    98125   538000
10         3       2.50         3560      9796     1.0    98007   662500
15         4       3.00         2950      5000     2.0    98126   650000
21         3       2.75         3050     44867     1.0    98040  2000000
22         5       2.50         2270      6300     2.0    98092   285000

In [93]:
len(scale)/len(df)

0.4266413732475825

In [100]:
# What is the difference in RMSE between the model trained with my_features and the one trained with advanced_features?
X_used = data[my_features]
X_advanced = data[advanced_features]
y = data.price

In [107]:
# used data
X_train, X_test, y_train, y_test = train_test_split(X_used, y, test_size=0.3, random_state=42)

In [108]:
# regression
model = LinearRegression()
model.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [109]:
y_pred = model.predict(X_test)

In [110]:
RMSE_used = mean_squared_error(y_test, y_pred)

In [111]:
# advanced features
X_train, X_test, y_train, y_test = train_test_split(X_advanced, y, test_size=0.3, random_state=42)
model = LinearRegression()
model.fit(X_train, y_train)
y_pred = model.predict(X_test)
RMSE_adv = mean_squared_error(y_test, y_pred)

In [114]:
RMSE_used - RMSE_adv

28008759518.797302